results/oltp_read_only_8thr_2m/20240115-171919_2a3cfc96656d85f42fa01537af93fd2ead1d9ca5_2.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 235.48 qps: 3859.40 (r/w/o: 3380.47/0.00/478.93) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 284.10 qps: 4526.60 (r/w/o: 3958.40/0.00/568.20) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 288.02 qps: 4630.26 (r/w/o: 4054.23/0.00/576.03) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 297.01 qps: 4746.10 (r/w/o: 4152.08/0.00/594.01) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 298.98 qps: 4775.62 (r/w/o: 4177.67/0.00/597.95) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 290.01 qps: 4633.21 (r/w/o: 4053.18/0.00/580.03) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 284.04 qps: 4552.62 (r/w/o: 3984.54/0.00/568.08) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 282.93 qps: 4527.85 (r/w/o: 3962.00/0.00/565.86) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 289.07 qps: 4605.13 (r/w/o: 4026.99/0.00/578.14) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 286.92 qps: 4592.75 (r/w/o: 4018.90/0.00/573.84) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 277.94 qps: 4452.97 (r/w/o: 3897.10/0.00/555.87) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 271.14 qps: 4347.19 (r/w/o: 3804.92/0.00/542.27) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 282.95 qps: 4511.13 (r/w/o: 3945.24/0.00/565.89) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 285.98 qps: 4595.70 (r/w/o: 4023.74/0.00/571.96) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 290.04 qps: 4640.60 (r/w/o: 4060.52/0.00/580.07) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 298.00 qps: 4758.92 (r/w/o: 4162.93/0.00/595.99) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 314.02 qps: 5026.24 (r/w/o: 4398.21/0.00/628.03) lat (ms,99%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 311.94 qps: 4974.98 (r/w/o: 4351.11/0.00/623.87) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 285.05 qps: 4585.78 (r/w/o: 4015.68/0.00/570.10) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 281.03 qps: 4477.54 (r/w/o: 3915.47/0.00/562.07) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 276.00 qps: 4438.02 (r/w/o: 3886.02/0.00/552.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 275.00 qps: 4408.04 (r/w/o: 3858.03/0.00/550.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 282.00 qps: 4492.04 (r/w/o: 3928.04/0.00/564.01) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 276.00 qps: 4424.97 (r/w/o: 3872.97/0.00/552.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 278.98 qps: 4451.75 (r/w/o: 3893.78/0.00/557.97) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 287.01 qps: 4604.23 (r/w/o: 4030.20/0.00/574.03) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 289.96 qps: 4628.40 (r/w/o: 4048.47/0.00/579.92) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 287.04 qps: 4598.63 (r/w/o: 4024.55/0.00/574.08) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 279.89 qps: 4458.19 (r/w/o: 3898.42/0.00/559.77) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 281.96 qps: 4522.31 (r/w/o: 3958.39/0.00/563.91) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 279.08 qps: 4480.26 (r/w/o: 3922.10/0.00/558.16) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 286.92 qps: 4584.71 (r/w/o: 4010.87/0.00/573.84) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 287.15 qps: 4580.41 (r/w/o: 4006.11/0.00/574.30) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 281.01 qps: 4517.09 (r/w/o: 3955.08/0.00/562.01) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 273.95 qps: 4376.16 (r/w/o: 3828.26/0.00/547.89) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 288.02 qps: 4595.37 (r/w/o: 4019.32/0.00/576.05) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 277.97 qps: 4459.60 (r/w/o: 3903.65/0.00/555.95) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 282.06 qps: 4508.94 (r/w/o: 3944.82/0.00/564.12) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 286.00 qps: 4579.03 (r/w/o: 4007.03/0.00/572.00) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 285.00 qps: 4544.99 (r/w/o: 3974.99/0.00/570.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 275.00 qps: 4412.98 (r/w/o: 3863.98/0.00/549.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 281.96 qps: 4513.34 (r/w/o: 3948.43/0.00/564.92) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 273.93 qps: 4390.89 (r/w/o: 3843.02/0.00/547.86) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 277.11 qps: 4423.80 (r/w/o: 3869.58/0.00/554.23) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 270.93 qps: 4342.85 (r/w/o: 3801.00/0.00/541.86) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 282.01 qps: 4516.20 (r/w/o: 3952.18/0.00/564.03) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 301.97 qps: 4817.54 (r/w/o: 4213.60/0.00/603.94) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 276.05 qps: 4408.85 (r/w/o: 3856.75/0.00/552.11) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 281.97 qps: 4514.59 (r/w/o: 3950.64/0.00/563.95) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 293.00 qps: 4694.04 (r/w/o: 4108.04/0.00/586.01) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 285.98 qps: 4557.74 (r/w/o: 3985.77/0.00/571.97) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 276.05 qps: 4443.88 (r/w/o: 3891.77/0.00/552.11) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 284.00 qps: 4543.07 (r/w/o: 3975.06/0.00/568.01) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 283.96 qps: 4532.40 (r/w/o: 3964.47/0.00/567.92) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 295.00 qps: 4715.03 (r/w/o: 4125.03/0.00/590.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 283.99 qps: 4549.91 (r/w/o: 3981.92/0.00/567.99) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 279.05 qps: 4467.83 (r/w/o: 3909.73/0.00/558.10) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 278.93 qps: 4454.96 (r/w/o: 3897.09/0.00/557.87) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 276.95 qps: 4437.26 (r/w/o: 3883.35/0.00/553.91) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 283.11 qps: 4524.82 (r/w/o: 3958.59/0.00/566.23) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 276.00 qps: 4429.01 (r/w/o: 3877.01/0.00/552.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 283.93 qps: 4531.89 (r/w/o: 3964.03/0.00/567.86) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 280.07 qps: 4502.13 (r/w/o: 3941.99/0.00/560.14) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 282.94 qps: 4495.11 (r/w/o: 3929.22/0.00/565.89) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 266.99 qps: 4304.82 (r/w/o: 3770.84/0.00/533.98) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 286.01 qps: 4552.16 (r/w/o: 3980.14/0.00/572.02) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 281.06 qps: 4503.93 (r/w/o: 3941.82/0.00/562.12) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 277.94 qps: 4465.00 (r/w/o: 3909.12/0.00/555.88) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 279.06 qps: 4434.01 (r/w/o: 3875.88/0.00/558.13) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 276.99 qps: 4466.92 (r/w/o: 3912.93/0.00/553.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 274.01 qps: 4370.09 (r/w/o: 3822.08/0.00/548.01) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 274.95 qps: 4376.23 (r/w/o: 3826.32/0.00/549.90) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 274.97 qps: 4414.57 (r/w/o: 3864.63/0.00/549.95) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 279.01 qps: 4470.22 (r/w/o: 3912.20/0.00/558.03) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 293.03 qps: 4678.48 (r/w/o: 4092.42/0.00/586.06) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 285.02 qps: 4574.32 (r/w/o: 4004.28/0.00/570.04) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 279.90 qps: 4478.34 (r/w/o: 3918.55/0.00/559.79) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 281.12 qps: 4488.85 (r/w/o: 3926.62/0.00/562.23) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 270.00 qps: 4298.04 (r/w/o: 3758.04/0.00/540.01) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 276.00 qps: 4440.97 (r/w/o: 3888.97/0.00/552.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 280.97 qps: 4495.48 (r/w/o: 3933.55/0.00/561.94) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 280.03 qps: 4468.49 (r/w/o: 3908.42/0.00/560.06) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 285.96 qps: 4565.44 (r/w/o: 3993.51/0.00/571.93) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 302.04 qps: 4864.58 (r/w/o: 4260.51/0.00/604.07) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 294.97 qps: 4683.57 (r/w/o: 4093.62/0.00/589.95) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 291.98 qps: 4704.69 (r/w/o: 4120.73/0.00/583.96) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 316.05 qps: 5050.84 (r/w/o: 4418.74/0.00/632.11) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 291.97 qps: 4665.55 (r/w/o: 4081.61/0.00/583.94) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 303.99 qps: 4887.78 (r/w/o: 4279.81/0.00/607.97) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 302.02 qps: 4823.38 (r/w/o: 4219.34/0.00/604.05) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 300.96 qps: 4780.41 (r/w/o: 4178.48/0.00/601.93) lat (ms,99%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 281.05 qps: 4509.81 (r/w/o: 3947.71/0.00/562.10) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 275.00 qps: 4400.99 (r/w/o: 3850.99/0.00/550.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 280.98 qps: 4508.68 (r/w/o: 3946.72/0.00/561.96) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 282.95 qps: 4503.15 (r/w/o: 3937.26/0.00/565.89) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 280.01 qps: 4504.21 (r/w/o: 3944.18/0.00/560.03) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 286.01 qps: 4573.19 (r/w/o: 4001.17/0.00/572.02) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 281.92 qps: 4501.73 (r/w/o: 3937.88/0.00/563.84) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 282.07 qps: 4516.11 (r/w/o: 3951.97/0.00/564.14) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 277.05 qps: 4428.86 (r/w/o: 3874.75/0.00/554.11) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 273.01 qps: 4387.08 (r/w/o: 3841.07/0.00/546.01) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 283.94 qps: 4524.08 (r/w/o: 3956.20/0.00/567.88) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 285.00 qps: 4568.96 (r/w/o: 3998.96/0.00/569.99) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 284.06 qps: 4529.95 (r/w/o: 3962.83/0.00/567.12) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 271.00 qps: 4352.06 (r/w/o: 3809.06/0.00/543.01) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 276.99 qps: 4457.77 (r/w/o: 3903.80/0.00/553.97) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 289.01 qps: 4580.21 (r/w/o: 4002.18/0.00/578.03) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 283.00 qps: 4558.98 (r/w/o: 3992.98/0.00/566.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 294.00 qps: 4658.06 (r/w/o: 4070.05/0.00/588.01) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 296.00 qps: 4747.98 (r/w/o: 4155.98/0.00/592.00) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 281.00 qps: 4495.00 (r/w/o: 3933.00/0.00/562.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 274.00 qps: 4403.99 (r/w/o: 3855.99/0.00/548.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 271.00 qps: 4350.02 (r/w/o: 3808.02/0.00/542.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 275.00 qps: 4376.99 (r/w/o: 3826.99/0.00/550.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 277.00 qps: 4442.99 (r/w/o: 3888.99/0.00/554.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 282.00 qps: 4506.98 (r/w/o: 3942.98/0.00/564.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 279.00 qps: 4437.01 (r/w/o: 3879.01/0.00/558.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 284.93 qps: 4566.90 (r/w/o: 3997.03/0.00/569.86) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 285.07 qps: 4568.11 (r/w/o: 3997.98/0.00/570.14) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 281.00 qps: 4499.03 (r/w/o: 3937.03/0.00/562.00) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      20.366 |                                         3
      20.736 |                                         10
      21.112 |                                         16
      21.496 |                                         27
      21.886 |*                                        62
      22.284 |*                                        110
      22.689 |**                                       176
      23.101 |***                                      224
      23.521 |******                                   429
      23.948 |*******                                  584
      24.384 |***********                              888
      24.827 |*****************                        1317
      25.278 |***********************                  1756
      25.737 |*****************************            2222
      26.205 |***********************************      2736
      26.681 |**************************************   2961
      27.165 |**************************************** 3117
      27.659 |**************************************** 3088
      28.162 |**************************************   2924
      28.673 |*********************************        2578
      29.194 |**************************               2056
      29.725 |*******************                      1515
      30.265 |**************                           1091
      30.815 |*********                                729
      31.375 |******                                   502
      31.945 |****                                     335
      32.525 |***                                      236
      33.116 |**                                       171
      33.718 |**                                       156
      34.330 |**                                       160
      34.954 |**                                       134
      35.589 |**                                       117
      36.236 |*                                        80
      36.894 |*                                        62
      37.565 |*                                        48
      38.247 |                                         36
      38.942 |*                                        39
      39.650 |*                                        42
      40.370 |*                                        58
      41.104 |*                                        64
      41.851 |*                                        87
      42.611 |**                                       117
      43.385 |**                                       140
      44.173 |**                                       160
      44.976 |**                                       129
      45.793 |**                                       127
      46.625 |*                                        111
      47.472 |*                                        88
      48.335 |*                                        51
      49.213 |*                                        49
      50.107 |                                         22
      51.018 |                                         18
      51.945 |                                         9
      52.889 |                                         2
      53.850 |                                         11
      54.828 |                                         8
      55.824 |                                         2
      56.839 |                                         3
      58.923 |                                         1
      61.083 |                                         3
      62.193 |                                         4
      63.323 |                                         1
      64.474 |                                         1
      65.645 |                                         1
      68.053 |                                         2
      69.289 |                                         1
      70.548 |                                         1
 
SQL statistics:
    queries performed:
        read:                            476112
        write:                           0
        other:                           68016
        total:                           544128
    transactions:                        34008  (283.33 per sec.)
    queries:                             544128 (4533.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      283.3299
    time elapsed:                        120.0297s
    total number of events:              34008

Latency (ms):
         min:                                   20.39
         avg:                                   28.23
         max:                                   70.10
         99th percentile:                       46.63
         sum:                               960088.70

Threads fairness:
    events (avg/stddev):           4251.0000/13.17
    execution time (avg/stddev):   120.0111/0.01